let lsass=DeviceEvents
| where Timestamp > ago (30d)
| where ActionType == "AsrLsassCredentialTheftAudited"
| mv-expand  todynamic(AdditionalFields)
| extend isAudit = tostring(AdditionalFields.IsAudit)
| where isAudit = true
| summarize LsassAudit=make_set(InitiatingProcessCommandLine) by DeviceName
| extend ['Count of Processes']=array_length(LsassAudit)
| sort by ['Count of Processes'] desc;
let psexec=DeviceEvents
| where Timestamp > ago (30d)
| where ActionType == "AsrPsexecWmiChildProcessAudited"
| mv-expand  todynamic(AdditionalFields)
| extend isAudit = tostring(AdditionalFields.IsAudit)
| where isAudit = true
| summarize PsExecAudit=make_set(InitiatingProcessCommandLine) by DeviceName
| extend ['Count of psexec Processes']=array_length(PsExecAudit)
| sort by ['Count of psexec Processes'] desc;
union lsass,psexec