let LsassEvents=DeviceEvents
| where TimeGenerated > ago (30d)
| where ActionType == "AsrLsassCredentialTheftAudited"
| mv-expand todynamic(AdditionalFields)
| extend isAudit = tostring(AdditionalFields.IsAudit)
| where isAudit = true
| summarize LSASSInitProc=make_set(InitiatingProcessCommandLine), LSASSProc=make_set(ProcessCommandLine) by DeviceName
| extend ['Count of unique LSASS ASR proc Audited']=array_length(LSASSInitProc)
| sort by ['Count of Processes'] desc;
let psexec=DeviceEvents
| where TimeGenerated > ago (30d)
| where ActionType == "AsrPsexecWmiChildProcessAudited"
| mv-expand  todynamic(AdditionalFields)
| extend isAudit = tostring(AdditionalFields.IsAudit)
| where isAudit = true
| summarize PsExecInitProc=make_set(InitiatingProcessCommandLine), PsExecProc=make_set(ProcessCommandLine) by DeviceName
| extend ['Count of psexec Processes']=array_length(PsExecInitProc)
| sort by ['Count of psexec Processes'] desc;
union LsassEvents, psexec